In [1]:
# importing required libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn import linear_model

In [2]:
# load dataset
df1 =pd.read_excel('agri_data.xlsx' )
df1.head()

,Domain Code,Domain,Area Code (M49),Area,Element Code,Element,Item Code (CPC),Item,Year Code,Year,Unit,Value,Flag,Flag Description
0,QCL,Crops and livestock products,404,Kenya,5510,Production,1929.07,"Abaca, manila hemp, raw",1976,1976,tonnes,10.0,E,Estimated value
1,QCL,Crops and livestock products,404,Kenya,5510,Production,1929.07,"Abaca, manila hemp, raw",1977,1977,tonnes,10.0,E,Estimated value
2,QCL,Crops and livestock products,404,Kenya,5510,Production,1929.07,"Abaca, manila hemp, raw",1978,1978,tonnes,10.0,E,Estimated value
3,QCL,Crops and livestock products,404,Kenya,5510,Production,1929.07,"Abaca, manila hemp, raw",1979,1979,tonnes,10.0,E,Estimated value
4,QCL,Crops and livestock products,404,Kenya,5510,Production,1929.07,"Abaca, manila hemp, raw",1980,1980,tonnes,10.0,E,Estimated value

In [3]:
df1.tail()

,Domain Code,Domain,Area Code (M49),Area,Element Code,Element,Item Code (CPC),Item,Year Code,Year,Unit,Value,Flag,Flag Description
18177,QCL,Crops and livestock products,404,Kenya,5510,Production,1540,Yams,2017,2017,tonnes,10417.00,A,Official figure
18178,QCL,Crops and livestock products,404,Kenya,5510,Production,1540,Yams,2018,2018,tonnes,9610.49,A,Official figure
18179,QCL,Crops and livestock products,404,Kenya,5510,Production,1540,Yams,2019,2019,tonnes,9860.36,A,Official figure
18180,QCL,Crops and livestock products,404,Kenya,5510,Production,1540,Yams,2020,2020,tonnes,8009.16,A,Official figure
18181,QCL,Crops and livestock products,404,Kenya,5510,Production,1540,Yams,2021,2021,tonnes,7669.00,A,Official figure

In [4]:
df1.shape

(18182, 14)

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18182 entries, 0 to 18181
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       18182 non-null  object
 1   Domain            18182 non-null  object
 2   Area Code (M49)   18182 non-null  int64
 3   Area              18182 non-null  object
 4   Element Code      18182 non-null  int64
 5   Element           18182 non-null  object
 6   Item Code (CPC)   18182 non-null  object
 7   Item              18182 non-null  object
 8   Year Code         18182 non-null  int64
 9   Year              18182 non-null  int64
 10  Unit              18182 non-null  object
 11  Value             18182 non-null  float64
 12  Flag              18182 non-null  object
 13  Flag Description  18182 non-null  object
dtypes: float64(1), int64(4), object(9)
memory usage: 1.9+ MB

In [6]:
df1.nunique()

Domain Code             1
Domain                  1
Area Code (M49)         1
Area                    1
Element Code           18
Element                 9
Item Code (CPC)       150
Item                  150
Year Code              61
Year                   61
Unit                   12
Value               10318
Flag                    5
Flag Description        5
dtype: int64

In [7]:
df1.describe()

       Area Code (M49)  Element Code     Year Code          Year         Value
count          18182.0  18182.000000  18182.000000  18182.000000  1.818200e+04
mean             404.0   5413.666538   1994.152513   1994.152513  3.257563e+05
std                0.0     96.653696     17.136119     17.136119  1.501639e+06
min              404.0   5111.000000   1961.000000   1961.000000  0.000000e+00
25%              404.0   5312.000000   1980.000000   1980.000000  2.100000e+03
50%              404.0   5419.000000   1996.000000   1996.000000  1.300000e+04
75%              404.0   5510.000000   2009.000000   2009.000000  8.505925e+04
max              404.0   5513.000000   2021.000000   2021.000000  3.602118e+07

In [8]:
df1.isnull().sum()

Domain Code         0
Domain              0
Area Code (M49)     0
Area                0
Element Code        0
Element             0
Item Code (CPC)     0
Item                0
Year Code           0
Year                0
Unit                0
Value               0
Flag                0
Flag Description    0
dtype: int64

In [9]:
df1.duplicated().sum()

0

In [10]:
df1.columns

Index(['Domain Code', 'Domain', 'Area Code (M49)', 'Area', 'Element Code',
       'Element', 'Item Code (CPC)', 'Item', 'Year Code', 'Year', 'Unit',
       'Value', 'Flag', 'Flag Description'],
      dtype='object')

In [11]:
# droping redudant data, the data we do not need for our analysis and modelling
df= df1.drop(['Domain Code', 'Domain', 'Area Code (M49)', 'Area', 'Element Code','Item Code (CPC)','Year Code','Flag', 'Flag Description'], axis= 1)

In [16]:
df.head()

      Element                     Item  Year    Unit  Value
0  Production  Abaca, manila hemp, raw  1976  tonnes   10.0
1  Production  Abaca, manila hemp, raw  1977  tonnes   10.0
2  Production  Abaca, manila hemp, raw  1978  tonnes   10.0
3  Production  Abaca, manila hemp, raw  1979  tonnes   10.0
4  Production  Abaca, manila hemp, raw  1980  tonnes   10.0

In [18]:
print(df['Unit'])

0        tonnes
1        tonnes
2        tonnes
3        tonnes
4        tonnes
          ...
18177    tonnes
18178    tonnes
18179    tonnes
18180    tonnes
18181    tonnes
Name: Unit, Length: 18182, dtype: object

In [26]:
df['Unit'].value_counts()

tonnes       7047
ha           4171
hg/ha        4109
Head         1408
hg/An         732
1000 Head     297
No            121
0.1g/An       114
100mg/An       61
hg             60
No/An          31
1000 No        31
Name: Unit, dtype: int64